Tekla Open API Reference for Tekla Structures 2025
RebarCranking.CrankingType Property
 Gets or sets the cranking type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarCranking.CrankingTypeEnum CrankingType { get; set; }
Public Property CrankingType As RebarCranking.CrankingTypeEnum
	Get
	Set
Property Value
Type: RebarCranking.CrankingTypeEnum
See Also
Reference
RebarCranking Class
Tekla.Structures.Model Namespace